app/views/monsters/show.html.erb

<br/>
<p>Campaigns: <% @monster.campaigns.each do |campaign| %>
---
SELECT "campaigns".* FROM "campaigns" INNER JOIN "campaign_monsters" ON "campaigns"."id" = "campaign_monsters"."campaign_id" WHERE "campaign_monsters"."monster_id" = ?  [["monster_id", 11]]