app/views/players/_player.html.erb

SELECT "characters".* FROM "characters" WHERE "characters"."player_id" = ?  [["player_id", 30]]
---
</p>
<p>Characters: <% player.characters.each do |character| %>