app/controllers/campaigns_controller.rb

  def show
    @campaign = Campaign.find(params[:id])
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]