app/controllers/monsters_controller.rb

  def show
    @monster = Monster.find(params[:id])
---
SELECT "monsters".* FROM "monsters" WHERE "monsters"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]