app/controllers/players_controller.rb

  def index
    @players = Player.order(:name)
---
SELECT "players".* FROM "players" ORDER BY "players"."name" ASC

  def show
    @player = Player.find(params[:id])
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]

  def search
    @player = Player.where('name LIKE ?', "%#{params[:search_term]}%")
---
SELECT "players".* FROM "players" WHERE (name LIKE '%Allegra Ebert%')