app/views/campaigns/show.html.erb

<br/>
<p>Characters: <% @campaign.characters.each do |character| %>
---
SELECT "characters".* FROM "characters" WHERE "characters"."campaign_id" = ?  [["campaign_id", 2]]

<br/>
<p>Monsters: <% @campaign.monsters.each do |monster| %>
---
SELECT "monsters".* FROM "monsters" INNER JOIN "campaign_monsters" ON "monsters"."id" = "campaign_monsters"."monster_id" WHERE "campaign_monsters"."campaign_id" = ?  [["campaign_id", 2]]